/**
 * BCP 47 Locale
 */
type Locale =
  | "" //默認
  | "zh-CN" // 中國大陸，簡體中文
  | "zh-TW" // 台灣，繁體中文
  | "zh-HK" // 香港，繁體中文
  | "en-US" // 美國英語
  | "en-GB" // 英國英語
  | "en-AU" // 澳大利亞英語
  | "en-CA" // 加拿大英語
  | "en-IN" // 印度英語
  | "fr-FR" // 法國法語
  | "fr-CA" // 加拿大法語
  | "de-DE" // 德國德語
  | "de-CH" // 瑞士德語
  | "es-ES" // 西班牙西班牙語
  | "es-MX" // 墨西哥西班牙語
  | "es-US" // 美國西班牙語
  | "ja-JP" // 日本日語
  | "ko-KR" // 韓國韓語
  | "ru-RU" // 俄羅斯俄語
  | "pt-BR" // 巴西葡萄牙語
  | "pt-PT" // 葡萄牙葡萄牙語
  | "ar-SA" // 沙烏地阿拉伯阿拉伯語
  | "ar-EG" // 埃及阿拉伯語
  | "hi-IN" // 印度印地語
  | "it-IT" // 義大利義大利語
  | "it-CH" // 瑞士義大利語
  | "nl-NL" // 荷蘭荷蘭語
  | "nl-BE" // 比利時荷蘭語
  | "pl-PL" // 波蘭波蘭語
  | "vi-VN" // 越南越南語
  | "th-TH" // 泰國泰語
  | "el-GR" // 希臘希臘語
  | "tr-TR" // 土耳其土耳其語
  | "sv-SE" // 瑞典瑞典語
  | "fil-PH"; // 菲律宾语（菲律宾）
